In [1]:
#Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes

In [2]:
! pip install sqlalchemy
! pip install PyMySQL

Requirement already satisfied: sqlalchemy in /Users/usuari/opt/anaconda3/lib/python3.9/site-packages (1.4.32)
Requirement already satisfied: greenlet!=0.4.17 in /Users/usuari/opt/anaconda3/lib/python3.9/site-packages (from sqlalchemy) (1.1.1)
Requirement already satisfied: PyMySQL in /Users/usuari/opt/anaconda3/lib/python3.9/site-packages (1.0.2)

In [3]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  
password = getpass.getpass()

········

In [12]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

rentals_may = pd.read_sql_query('SELECT * FROM rentals_may', engine)
rentals_may.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [13]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

rentals_june = pd.read_sql_query('SELECT * FROM rentals_june', engine)
rentals_june.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

In [6]:
#Check the number of rentals for each customer for May

In [37]:
query = '''
        select count(rental_id) from sakila.rentals_may
        '''

countrentals_may = pd.read_sql_query(query, engine)
countrentals_may.head()

   count(rental_id)
0              1156

In [38]:
#Check the number of rentals for each customer for June

In [39]:
query = '''
        select count(rental_id) from sakila.rentals_june
        '''

countrentals_june = pd.read_sql_query(query, engine)
countrentals_june.head()

   count(rental_id)
0              2311

In [10]:
# Write a function that checks if customer borrowed more or less films in the month of June as compared to May.

In [25]:
rentals_mayjune = pd.merge(rentals_may,rentals_june, how="outer")
rentals_mayjune

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
3462,3465,2005-06-21 22:10:01,1488,510,2005-06-30 21:35:01,1,2006-02-15 21:30:53
3463,3466,2005-06-21 22:13:33,371,226,2005-06-25 21:01:33,2,2006-02-15 21:30:53
3464,3467,2005-06-21 22:19:25,729,543,2005-06-27 00:03:25,2,2006-02-15 21:30:53
3465,3468,2005-06-21 22:43:45,2899,100,2005-06-30 01:49:45,1,2006-02-15 21:30:53
3466,3469,2005-06-21 22:48:59,4087,181,2005-06-28 19:32:59,1,2006-02-15 21:30:53

In [52]:
countrentals_may
countrentals_june
if 'countrentals_may' > 'rentals_mayjune' :
    print("customer borrowed more films in May")
else:
    
    print("customer borrowed more films in June")

customer borrowed more films in June

In [55]:
countrentals_may
countrentals_june
def MayVsJune (countrentals_may,countrentals_june):

    if 'countrentals_may' > 'rentals_mayjune' :
   
        return ("customer borrowed more films in May")

    else:
    
        return("customer borrowed more films in June")

In [56]:
MayVsJune (countrentals_may,countrentals_june)

'customer borrowed more films in June'